# Pandas - Week 3

***

## Membagi data frame menjadi dua secara acak

### 1. Import Modules

In [1]:
import pandas as pd
import numpy as np

### 2. Persiapan Data Frame

In [3]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), columns = cols)

df

    A   B   C   D   E
0  19  15   9   1   3
1  14  14  18  18   1
2  18  16  19  17   6
3  16   8   2   7  10
4   8  12  17   3  15
5   6  19  17  11   5
6   4  19  18  11   2
7  13   6   1   9  14
8   9  12   9  12  15
9   3   4   9  13   9

### 3. Membagi Data Frame menjadi dua secara acak berdasarkan proporsi tertentu.

In [4]:
df.shape

(10, 5)

In [5]:
proporsi = 0.7 #Penentuan proposi: 70% untuk Data Frame 1, dan 30% untuk DF 2.
df_1 = df.sample(frac=proporsi)
df_2 = df.drop(df_1.index) #Menghapus baris yang sudah diadopsi oleh df_1.

print(f'df_1 shape: {df_1.shape}')
print(f'df_2 shape: {df_2.shape}')

df_1 shape: (7, 5)
df_2 shape: (3, 5)

Fungsi `sample()` merupakan method yang akan mengambil baris secara acak berdasarkan proporsi yang sudah ditentukan dari baris-baris dataframe DF dan akan ditampung di DF_1.

In [6]:
df_1

    A   B   C   D   E
7  13   6   1   9  14
5   6  19  17  11   5
6   4  19  18  11   2
3  16   8   2   7  10
0  19  15   9   1   3
1  14  14  18  18   1
2  18  16  19  17   6

In [7]:
df_2

   A   B   C   D   E
4  8  12  17   3  15
8  9  12   9  12  15
9  3   4   9  13   9